Autodesk.Revit.Exceptions.ApplicationException.FunctionId
The information of the function throwing the exception.

Autodesk.Revit.Exceptions.ApplicationException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.ApplicationException
The exception that is thrown when a non-fatal application error occurs.
Remarks: This class is the base class of all Revit specified exceptions.